from django.http import HttpResponse
from django.shortcuts import render

from goods.models import Categories



def index(requst):


    context = {
        'title': 'Bookstore - Головна',
        'content': 'Магазин книг Bookstore',
    }

    return render(requst, 'main/index.html', context)


def about(requst):
    context = {
        'title': 'Bookstore - Про нас',
        'content': 'Про нас',
        'text_on_page': 'Ласкаво просимо до Bookstore – вашого особистого гіда у світ безмежних книжкових можливостей. Ми створили цей магазин для тих, хто цінує справжню літературну магію та прагне зануритись у дивовижні історії, які змінюють життя. Наша місія – дарувати кожному читачеві незабутні миті радості, мудрості та натхнення через книги. Ми віримо, що книга – це більше, ніж просто слова на папері. Це вікно в інший світ, подорож у часі та просторі, а також надійний друг у будь-якій життєвій ситуації. Заглядайте до Bookstore, де кожна книга – це нова пригода, а кожна сторінка – це крок до відкриття чогось особливого. Приєднуйтесь до нашої великої родини читачів і дозвольте нам супроводжувати вас у ваших літературних мандрівках!'
    }

    return render(requst, 'main/about.html', context)


def delivery_information(requst):
    context = {
        'title': 'Bookstore - Доставка та оплата',
        'content': 'Доставка та оплата',
        'text_on_page': 'У нашому інтернет-магазині книжок доступні зручні варіанти доставки та оплати для забезпечення максимальної зручності наших клієнтів. Доставка здійснюється кур’єром за вказаною адресою, що гарантує швидке та безпечне отримання вашого замовлення, або можливий самовивіз за адресою м. Київ, вул. Літературна, 10. Для оплати ви можете обрати один з двох варіантів: здійснити оплату на банківську карту після оформлення замовлення, коли з вами зв’яжеться, або сплатити готівкою або картою при отриманні товару. Такий підхід дозволяє кожному клієнту вибрати найзручніший для себе спосіб оплати та отримання замовлення.'
    }

    return render(requst, 'main/about.html', context)


def contacts(requst):
    context = {
        'title': 'Bookstore - Контактна інформація',
        'content': 'Контактна інформація',
        'text_on_page': 'Для зв’язку з нами ви можете скористатися такими засобами: телефонуйте на номер +38 (044) 123-45-67 з понеділка по п’ятницю з 9:00 до 18:00, пишіть на електронну пошту info@bookstore.ua, або завітайте до нашого офісу за адресою: м. Київ, вул. Літературна, 10.'
    }

    return render(requst, 'main/about.html', context)